## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: gcp/prod
**Workspace**: default
**Success**: :thumbsup:

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.gke-cinema.google_container_cluster.primary has changed
!   resource "google_container_cluster" "primary" {
        id                          = "projects/wayofthesys-cinema-363715/locations/us-central1/clusters/cinema"
        name                        = "cinema"
        # (27 unchanged attributes hidden)

!       node_pool {
            name                        = "core"
!           node_count                  = 4 -> 5
            # (6 unchanged attributes hidden)

            # (4 unchanged blocks hidden)
        }

        # (18 unchanged blocks hidden)
    }

  # module.gke-cinema.google_container_node_pool.pools["core"] has changed
!   resource "google_container_node_pool" "pools" {
        id                          = "projects/wayofthesys-cinema-363715/locations/us-central1/clusters/cinema/nodePools/core"
        name                        = "core"
!       node_count                  = 4 -> 5
        # (9 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place

Terraform will perform the following actions:

  # kubernetes_annotations.cinema will be updated in-place
!   resource "kubernetes_annotations" "cinema" {
!       annotations = {
+           "mesh.cloud.google.com/proxy" = jsonencode(
                {
+                   managed = "true"
                }
            )
        }
        id          = "apiVersion=v1,kind=Namespace,name=cinema"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # kubernetes_manifest.cinema-gateway will be created
+   resource "kubernetes_manifest" "cinema-gateway" {
+       manifest = {
+           apiVersion = "networking.istio.io/v1beta1"
+           kind       = "Gateway"
+           metadata   = {
+               name      = "cinema"
+               namespace = "cinema"
            }
+           spec       = {
+               selector = {
+                   istio = "ingressgateway"
                }
+               servers  = [
+                   {
+                       hosts = [
+                           "wayofthesys.com",
                        ]
+                       port  = {
+                           name     = "http"
+                           number   = 80
+                           protocol = "HTTP"
                        }
+                       tls   = {
+                           httpsRedirect = false
                        }
                    },
+                   {
+                       hosts = [
+                           "wayofthesys.com",
                        ]
+                       port  = {
+                           name     = "https"
+                           number   = 443
+                           protocol = "HTTPS"
                        }
+                       tls   = {
+                           credentialName    = "wayofthesys-com-tls"
+                           mode              = "SIMPLE"
+                           privateKey        = "/etc/istio/ingressgateway-certs/tls.key"
+                           serverCertificate = "/etc/istio/ingressgateway-certs/tls.crt"
                        }
                    },
                ]
            }
        }
+       object   = {
+           apiVersion = "networking.istio.io/v1beta1"
+           kind       = "Gateway"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "cinema"
+               namespace                  = "cinema"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           spec       = {
+               selector = {
+                   "istio" = "ingressgateway"
                }
+               servers  = [
+                   {
+                       bind            = (known after apply)
+                       defaultEndpoint = (known after apply)
+                       hosts           = [
+                           "wayofthesys.com",
                        ]
+                       name            = (known after apply)
+                       port            = {
+                           name       = "http"
+                           number     = 80
+                           protocol   = "HTTP"
+                           targetPort = (known after apply)
                        }
+                       tls             = {
+                           caCertificates        = (known after apply)
+                           cipherSuites          = (known after apply)
+                           credentialName        = (known after apply)
+                           httpsRedirect         = false
+                           maxProtocolVersion    = (known after apply)
+                           minProtocolVersion    = (known after apply)
+                           mode                  = (known after apply)
+                           privateKey            = (known after apply)
+                           serverCertificate     = (known after apply)
+                           subjectAltNames       = (known after apply)
+                           verifyCertificateHash = (known after apply)
+                           verifyCertificateSpki = (known after apply)
                        }
                    },
+                   {
+                       bind            = (known after apply)
+                       defaultEndpoint = (known after apply)
+                       hosts           = [
+                           "wayofthesys.com",
                        ]
+                       name            = (known after apply)
+                       port            = {
+                           name       = "https"
+                           number     = 443
+                           protocol   = "HTTPS"
+                           targetPort = (known after apply)
                        }
+                       tls             = {
+                           caCertificates        = (known after apply)
+                           cipherSuites          = (known after apply)
+                           credentialName        = "wayofthesys-com-tls"
+                           httpsRedirect         = (known after apply)
+                           maxProtocolVersion    = (known after apply)
+                           minProtocolVersion    = (known after apply)
+                           mode                  = "SIMPLE"
+                           privateKey            = "/etc/istio/ingressgateway-certs/tls.key"
+                           serverCertificate     = "/etc/istio/ingressgateway-certs/tls.crt"
+                           subjectAltNames       = (known after apply)
+                           verifyCertificateHash = (known after apply)
+                           verifyCertificateSpki = (known after apply)
                        }
                    },
                ]
            }
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:gcp/prod workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 249.71 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| gcp/prod | default | 0.00 | 249.71 | 249.71|
| | **Total** | **0.00** | **249.71** | **249.71** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
